In [1]:
import pandas as pd

pd.set_option('display.max_columns', None)

In [2]:
co2_emissions = pd.read_excel("co2_emissions_2023.xlsx", sheet_name='fossil_CO2_totals_by_country')

In [3]:
ewaste_rate = pd.read_csv('ewaste_europe.csv')

In [4]:
co2_emissions['Country'] = co2_emissions['Country'].replace('Spain and Andorra', 'Spain')
co2_emissions['Country'] = co2_emissions['Country'].replace('Italy, San Marino and the Holy See', 'Italy')
co2_emissions['Country'] = co2_emissions['Country'].replace('France and Monaco', 'France')

In [5]:
# Convertir los nombres de las columnas a cadenas
co2_emissions.columns = co2_emissions.columns.astype(str)

In [6]:
# Seleccionar las columnas que corresponden al rango 2010 a 2018
columnas_interes = ['Country'] + [str(year) for year in range(2010, 2019)]
co2_emissions_2010_2018 = co2_emissions[columnas_interes]

In [7]:
co2_emissions_2010_2018

,Country,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,Aruba,0.482207,0.290181,0.374857,0.412307,0.440689,0.462026,0.484889,0.466592,0.465881
1,Afghanistan,7.788893,11.408711,9.767756,8.300022,7.825741,8.346521,7.527594,8.066138,7.932005
2,Angola,22.739891,23.650038,24.716177,28.534220,30.887264,33.097499,31.285803,27.942099,26.258887
3,Anguilla,0.024024,0.026028,0.026044,0.027961,0.027917,0.028027,0.028363,0.029087,0.028247
4,International Aviation,466.657076,480.117814,483.676624,492.257229,507.505761,536.213680,560.173839,589.919315,615.937542
...,...,...,...,...,...,...,...,...,...,...
209,Zimbabwe,10.064956,15.845734,12.740022,12.715949,12.597723,12.689493,11.266275,10.585434,12.270039
210,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
211,EU27,3413.786632,3317.834810,3251.387665,3168.344668,3025.896239,3086.214921,3094.776695,3118.707522,3049.511170
212,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
213,GLOBAL TOTAL,34003.642051,35059.574178,35521.713679,36221.138282,36427.769713,36300.466451,36423.660699,37047.472031,37974.553886

In [8]:
# Obtener la lista de paÃ­ses del DataFrame de tasas de reciclaje
paises_ewaste = ewaste_rate.columns[1:]  # Asumimos que la primera columna es 'period' y los paÃ­ses empiezan desde la segunda columna

# Filtrar el DataFrame de emisiones de CO2 para que solo contenga los paÃ­ses de la lista
co2_emissions_filtrado = co2_emissions_2010_2018[co2_emissions_2010_2018['Country'].isin(paises_ewaste)]

# Agregar la fila de EU27
# Suponiendo que la fila de EU27 estÃ¡ etiquetada como 'EU27' en la columna 'Country'
# eu27 = co2_emissions_2010_2018[co2_emissions_2010_2018['Country'] == 'EU27']

# Concatenar el DataFrame filtrado con la fila de EU27
# co2_emissions_filtrado = pd.concat([co2_emissions_filtrado, eu27])

In [9]:
co2_emissions_filtrado.reset_index(inplace = True, drop= True)

In [10]:
co2_emissions_filtrado

,Country,2010,2011,2012,2013,2014,2015,2016,2017,2018
0,Austria,73.795780,72.194687,69.027133,69.612680,65.929043,67.369130,67.782518,70.106335,67.186843
1,Belgium,114.977049,104.572538,103.086332,104.422497,97.724460,102.379092,101.260962,99.700388,100.098118
2,Bulgaria,49.507656,54.782564,49.915051,44.450948,47.314848,49.854209,47.122418,49.279523,46.233112
3,Cyprus,7.913449,7.655683,7.120797,6.439487,6.816116,6.855027,7.220692,7.361896,7.212725
4,Czechia,120.989103,118.112919,114.023160,109.525948,107.232822,108.284669,109.808230,110.375009,109.338938
5,Germany,815.378388,788.547704,800.464752,818.278373,779.223120,785.387181,789.713787,774.948179,747.214477
6,Denmark,48.556617,43.487547,38.592086,40.339128,36.204293,34.073592,35.706428,33.572356,33.654437
7,Spain,291.243111,293.161781,287.397089,260.597829,258.015469,275.078590,266.531106,281.695409,275.130061
8,Estonia,21.557955,21.673616,20.523597,22.914407,21.920755,19.990961,19.979761,21.222721,22.358838
9,Finland,65.842453,58.217076,52.320102,53.327236,49.437362,45.970950,48.803471,46.072987,47.434796
10,France,377.759830,364.313865,366.138777,360.992429,328.087892,332.974873,335.767833,339.345802,328.630175
11,United Kingdom,500.628497,459.017411,481.189956,470.171827,430.496235,415.856048,393.343901,381.285415,373.220549
12,Greece,89.091916,86.135670,81.546196,73.865858,71.004201,69.447552,68.156035,68.378911,66.582306
13,Croatia,20.938743,20.452265,18.785356,18.379105,17.674763,18.022000,18.272572,18.795394,17.764369
14,Hungary,52.334966,51.427413,47.643747,44.788041,44.822256,47.535032,48.266447,51.162888,50.907818
15,Ireland,40.922752,37.143431,37.596330,36.330979,36.140342,37.645011,39.522147,38.291366,37.169674
16,Iceland,3.737239,3.604618,3.645902,3.711373,3.464603,3.629921,3.179597,3.330655,3.313931
17,Italy,424.040278,414.907024,394.857325,362.099395,343.352345,354.020515,349.447071,345.934011,340.608904
18,Lithuania,14.039047,14.318004,14.488305,13.361427,13.208708,13.657581,13.516495,13.960852,14.015943
19,Luxembourg,11.213261,11.089930,10.867628,10.323391,9.819789,9.309285,9.041289,9.188187,9.468765
20,Latvia,8.878573,8.231763,8.025566,7.777484,7.571765,7.646089,7.478487,7.430295,8.105917
21,Malta,2.595201,2.582334,2.724874,2.382566,2.369258,1.672087,1.365344,1.558073,1.567282
22,Netherlands,186.173492,174.130393,171.643382,169.402411,161.788444,169.417604,170.832094,168.091645,163.020856
23,Norway,47.984517,46.938413,46.389092,46.877239,46.989815,47.953799,47.370665,47.407931,46.953722
24,Poland,329.363828,326.913143,319.701452,315.069089,302.546121,305.747136,316.704930,330.199364,329.564445
25,Portugal,53.395886,51.544903,49.928286,48.293402,47.822506,51.876358,50.680020,55.303601,51.270681
26,Romania,83.336636,89.811682,87.626779,79.519574,78.979138,80.291397,78.694598,81.785581,82.989729
27,Slovakia,39.896596,37.884517,36.097579,36.370883,33.983767,34.511577,35.446904,37.718886,37.210341
28,Slovenia,17.162715,16.082267,15.519291,15.513950,14.130181,14.299098,15.025188,15.348216,15.343324
29,Sweden,52.881350,48.460093,45.726693,43.966152,42.776473,42.898323,42.629871,41.879648,39.428295

In [11]:
# Convertir a formato largo
co2_emissions_filtrado = pd.melt(co2_emissions_filtrado, id_vars=['Country'], var_name='Year', value_name='CO2_Emissions')

In [12]:
co2_emissions_filtrado

      Country  Year  CO2_Emissions
0     Austria  2010      73.795780
1     Belgium  2010     114.977049
2    Bulgaria  2010      49.507656
3      Cyprus  2010       7.913449
4     Czechia  2010     120.989103
..        ...   ...            ...
265  Portugal  2018      51.270681
266   Romania  2018      82.989729
267  Slovakia  2018      37.210341
268  Slovenia  2018      15.343324
269    Sweden  2018      39.428295

[270 rows x 3 columns]

In [13]:
ewaste_rate.rename(columns={'period': 'Year'}, inplace=True)

In [14]:
ewaste_rate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 34 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Year                           11 non-null     int64
 1   Austria                        11 non-null     float64
 2   Belgium                        11 non-null     float64
 3   Bulgaria                       9 non-null      float64
 4   Cyprus                         9 non-null      float64
 5   Czechia                        9 non-null      float64
 6   Germany                        10 non-null     float64
 7   Denmark                        10 non-null     float64
 8   Estonia                        10 non-null     float64
 9   Greece                         11 non-null     float64
 10  Spain                          10 non-null     float64
 11  European Union - 27 countries  9 non-null      float64
 12  European Union - 28 countries  9 non-null      float64
 13  Finland                        11 non-null     float64
 14  France                         10 non-null     float64
 15  Croatia                        5 non-null      float64
 16  Hungary                        11 non-null     float64
 17  Ireland                        9 non-null      float64
 18  Iceland                        7 non-null      float64
 19  Italy                          6 non-null      float64
 20  Liechtenstein                  5 non-null      float64
 21  Lithuania                      11 non-null     float64
 22  Luxembourg                     11 non-null     float64
 23  Latvia                         9 non-null      float64
 24  Malta                          9 non-null      float64
 25  Netherlands                    11 non-null     float64
 26  Norway                         11 non-null     float64
 27  Poland                         10 non-null     float64
 28  Portugal                       10 non-null     float64
 29  Romania                        8 non-null      float64
 30  Sweden                         11 non-null     float64
 31  Slovenia                       10 non-null     float64
 32  Slovakia                       11 non-null     float64
 33  United Kingdom                 9 non-null      float64
dtypes: float64(33), int64(1)
memory usage: 3.1 KB

In [15]:
ewaste_rate.isnull().sum(axis=1)

0     21
1     11
2      3
3      3
4      2
5      2
6      0
7      0
8      1
9      2
10     5
dtype: int64

In [16]:
# Eliminar los aÃ±os 2008 y 2009
ewaste_rate = ewaste_rate[~ewaste_rate['Year'].isin([2008, 2009])]

In [17]:
ewaste_rate.isnull().sum(axis=1)

2     3
3     3
4     2
5     2
6     0
7     0
8     1
9     2
10    5
dtype: int64

In [18]:
ewaste_rate.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 2 to 10
Data columns (total 34 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Year                           9 non-null      int64
 1   Austria                        9 non-null      float64
 2   Belgium                        9 non-null      float64
 3   Bulgaria                       9 non-null      float64
 4   Cyprus                         8 non-null      float64
 5   Czechia                        9 non-null      float64
 6   Germany                        9 non-null      float64
 7   Denmark                        9 non-null      float64
 8   Estonia                        9 non-null      float64
 9   Greece                         9 non-null      float64
 10  Spain                          9 non-null      float64
 11  European Union - 27 countries  9 non-null      float64
 12  European Union - 28 countries  9 non-null      float64
 13  Finland                        9 non-null      float64
 14  France                         9 non-null      float64
 15  Croatia                        5 non-null      float64
 16  Hungary                        9 non-null      float64
 17  Ireland                        9 non-null      float64
 18  Iceland                        7 non-null      float64
 19  Italy                          6 non-null      float64
 20  Liechtenstein                  5 non-null      float64
 21  Lithuania                      9 non-null      float64
 22  Luxembourg                     9 non-null      float64
 23  Latvia                         9 non-null      float64
 24  Malta                          8 non-null      float64
 25  Netherlands                    9 non-null      float64
 26  Norway                         9 non-null      float64
 27  Poland                         9 non-null      float64
 28  Portugal                       8 non-null      float64
 29  Romania                        7 non-null      float64
 30  Sweden                         9 non-null      float64
 31  Slovenia                       9 non-null      float64
 32  Slovakia                       9 non-null      float64
 33  United Kingdom                 9 non-null      float64
dtypes: float64(33), int64(1)
memory usage: 2.5 KB

In [19]:
ewaste_rate.fillna(method='ffill', inplace=True)

C:\Users\Laura Ortiz\AppData\Local\Temp\ipykernel_34188\1521930138.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  ewaste_rate.fillna(method='ffill', inplace=True)

In [20]:
ewaste_rate.shape

(9, 34)

In [21]:
ewaste_rate = ewaste_rate.drop(columns=['European Union - 27 countries', 'European Union - 28 countries', 'Liechtenstein'])

In [22]:
ewaste_rate.shape

(9, 31)

In [23]:
ewaste_rate = pd.melt(ewaste_rate, id_vars=['Year'], var_name='Country', value_name='e_waste_rate')

In [24]:
ewaste_rate = ewaste_rate.reindex(['Country', 'Year', 'e_waste_rate'], axis=1)
ewaste_rate = ewaste_rate.sort_values(by=['Country','Year'])
ewaste_rate

            Country  Year  e_waste_rate
0           Austria  2010          35.7
1           Austria  2011          37.1
2           Austria  2012          38.2
3           Austria  2013          37.6
4           Austria  2014          39.1
..              ...   ...           ...
265  United Kingdom  2014          29.6
266  United Kingdom  2015          36.6
267  United Kingdom  2016          49.8
268  United Kingdom  2017          42.2
269  United Kingdom  2018          67.0

[270 rows x 3 columns]

In [25]:
ewaste_rate.dtypes

Country          object
Year              int64
e_waste_rate    float64
dtype: object

In [26]:
co2_emissions_filtrado.dtypes

Country           object
Year              object
CO2_Emissions    float64
dtype: object

In [27]:
co2_emissions_filtrado = co2_emissions_filtrado.sort_values(by=['Country','Year'])
co2_emissions_filtrado.reset_index(inplace= True, drop= True)
co2_emissions_filtrado['Year'] = co2_emissions_filtrado['Year'].astype(int)
co2_emissions_filtrado

            Country  Year  CO2_Emissions
0           Austria  2010      73.795780
1           Austria  2011      72.194687
2           Austria  2012      69.027133
3           Austria  2013      69.612680
4           Austria  2014      65.929043
..              ...   ...            ...
265  United Kingdom  2014     430.496235
266  United Kingdom  2015     415.856048
267  United Kingdom  2016     393.343901
268  United Kingdom  2017     381.285415
269  United Kingdom  2018     373.220549

[270 rows x 3 columns]

In [28]:
df_combined = pd.merge(ewaste_rate, co2_emissions_filtrado, on=['Country', 'Year'])

In [29]:
df_combined

            Country  Year  e_waste_rate  CO2_Emissions
0           Austria  2010          35.7      73.795780
1           Austria  2011          37.1      72.194687
2           Austria  2012          38.2      69.027133
3           Austria  2013          37.6      69.612680
4           Austria  2014          39.1      65.929043
..              ...   ...           ...            ...
265  United Kingdom  2014          29.6     430.496235
266  United Kingdom  2015          36.6     415.856048
267  United Kingdom  2016          49.8     393.343901
268  United Kingdom  2017          42.2     381.285415
269  United Kingdom  2018          67.0     373.220549

[270 rows x 4 columns]